name: "yolov8s_dynamic"
backend: "onnxruntime"
default_model_filename: "best.onnx"
max_batch_size: 8

input [{
  name: "images"
  data_type: TYPE_FP32
  dims: [3, 640, 640]
}]

output [{
  name: "output0"
  data_type: TYPE_FP32
  dims: [84, -1]
}]

instance_group [{
  kind: KIND_GPU
  count: 1
}]

dynamic_batching {
  preferred_batch_size: [4, 8]
  max_queue_delay_microseconds: 1000
}
