name: "geoclassifier_trt"
backend: "tensorrt"
max_batch_size: 0

input [{
  name: "input"
  data_type: TYPE_FP32
  dims: [1, 3, 480, 480]
}]

output [{
  name: "output"
  data_type: TYPE_FP32
  dims: [1, 17]
}]

instance_group [{
  kind: KIND_GPU
  count: 1
}]
